zetteldesk.org
#+TITLE: Zetteldesk.el Literate Config

This file was originally part of my emacs config in the org-roam section. However, the more mature this package grew, I decided I should split it into its own org document so I can port it over to the zetteldesk.el github so it auto-tangles easier. In a way you can view this as some sort of documentation, but its just my thoughts when I write them. The proper documentation is really the wiki.

* Table of Contents                                                     :TOC:
- [[#implementing-the-zettelkasten-desktop-to-org-roam][Implementing the Zettelkasten "desktop" to org-roam]]
  - [[#description][Description]]
  - [[#dependencies][Dependencies]]
  - [[#predicate-functions][Predicate Functions]]
  - [[#adding-and-removing-things-in-the-zetteldesk][Adding and Removing things in the Zetteldesk]]
  - [[#filter-functions][Filter functions]]
  - [[#on-the-zetteldesk-scratch-buffer][On the zetteldesk-scratch buffer]]
  - [[#save-the-state-of-the-zetteldesk][Save the state of the zetteldesk]]
- [[#keybindings][Keybindings]]
- [[#org-remark-integration][Org-remark integration]]
  - [[#preamble][Preamble]]
  - [[#code][Code]]
- [[#handling-notes-on-articles-better---literature-notes][Handling notes on articles better - Literature Notes]]
  - [[#preamble-1][Preamble]]
  - [[#reference-notes-from-bibtex-entries][Reference notes from Bibtex Entries]]
  - [[#using-citar-as-a-backend-for-zetteldesk-ref][Using Citar as a backend for zetteldesk-ref]]
- [[#info-nodes][Info Nodes]]
  - [[#preamble-2][Preamble]]
  - [[#the-rest-of-the-code][The rest of the code]]
- [[#providing-the-packages-to-be-loaded-in-initel][Providing the packages to be loaded in init.el]]

* Implementing the Zettelkasten "desktop" to org-roam 
  A desktop, is the top surface of a desk, or in the digital world an area in a computer screen in which some people arrange their icons, similarly to how they would arrange stuff in their desk. Now if I had an irl zettelkasten, I know for sure that my desktop would be filled with little notes with various topic when studying something. So why shouldn't I have a digital desktop where I can spread all my notes and look at them one by one, when studying. Wouldn't that be handy?

  This very thought is what started this idea. The idea of the zettelkasten-desktop, which I shortened to zetteldesk as I wanted my functions to not have huge names. The plan for the finished project is a dedicated buffer in which I can input whichever note I want and view them all at the same time, a way to create a true desktop experience inside emacs.
  
** Description
   I have published this as a package on github so a description is needed in the top of the file. This section is basically that part.

   #+BEGIN_SRC elisp :tangle zetteldesk.el

     ;;; zetteldesk.el --- A revision and outlining tool for org-roam  -*- lexical-binding: t; -*-

     ;; Author: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
     ;; Maintainer: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
     ;; URL: https://github.com/Vidianos-Giannitsis/zetteldesk.el
     ;; Package-Requires: ((emacs "27.1") (org-roam "2.0"))
     ;; Tested on Emacs 27.2 and org-roam v2.2
     ;; Created: 6th February 2022
     ;; License: GPL-3.0
     ;; Version: 1.0.1

     ;; This file is free software; you can redistribute it and/or modify
     ;; it under the terms of the GNU General Public License as published by
     ;; the Free Software Foundation; either version 3, or (at your option)
     ;; any later version.

     ;; This program is distributed in the hope that it will be useful,
     ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
     ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
     ;; GNU General Public License for more details.

     ;; For a full copy of the GNU General Public License
     ;; see <https://www.gnu.org/licenses/>.

     ;;; Commentary:

     ;; This package provides various filter functions to "traverse" your
     ;; org-roam database more smoothly.  I use it for doing revision in
     ;; lessons and I personally find it highly efficient for this
     ;; purpose.  Its also good to just sort out your thoughts.  In general,
     ;; org-roam lacks a good framework for filtering your nodes although
     ;; it has all the backend for doing that.

     ;;; Code:
   #+END_SRC
   
** Dependencies
   As I want this to work independently to my config, this section has a copy of all the custom function I use which were not defined in this section as I felt they fit more somewhere else in my config. These are the dependencies this has from my config. For general dependencies I will do those once this is actually complete enough to make its own package

   #+BEGIN_SRC elisp :tangle zetteldesk.el

     ;; -- DEPENDENCIES --
     ;; These are some functions that are needed for the package to work as
     ;; it should, but that are not specific to the package

     (require 'org-roam)

     (cl-defmethod org-roam-node-buffer ((node org-roam-node))
       "Access slot \"buffer\" of org-roam-node struct CL-X.
     NODE is an org-roam-node"
       (let ((buffer (get-file-buffer (org-roam-node-file node))))
	 buffer))

     (cl-defmethod org-roam-node-backlinkscount-number ((node org-roam-node))
	 "Access slot \"backlinks\" of org-roam-node struct CL-X.

     This is identical to `org-roam-node-backlinkscount' with the
	 difference that it returns a number instead of a fromatted
	 string. This is to be used in
	 `zetteldesk-roam-node-sort-by-backlinks'. NODE is an org-roam-node."
	 (let* ((count (caar (org-roam-db-query
			      [:select (funcall count source)
				       :from links
				       :where (= dest $s1)
				       :and (= type "id")]
			      (org-roam-node-id node)))))
	   count))

     (defun zetteldesk-roam-node-poi-or-moc-p (NODE)
       "Check if NODE has the tag POI or the tag MOC.  Return t if it does."
       (or (string-equal (car (org-roam-node-tags NODE)) "POI")
	   (string-equal (car (org-roam-node-tags NODE)) "MOC")))

     (defun zetteldesk-roam-backlink-query ()
       "Simple org-roam query function.
     Stores the IDs of all the files that link to the node at point.
     This is a modified part of the `org-roam-backlinks-get' function
     keeping only the part necessary for `org-roam-backlink-files' to
     work as this is a complimentary function to that"
       (org-roam-db-query
	[:select [source dest]
		 :from links
		 :where (= dest $s1)
		 :and (= type "id")]
	(org-roam-node-id (org-roam-node-at-point))))

     (defun zetteldesk-roam-backlink-query* (NODE)
       "Run `zetteldesk-roam-backlink-query' with NODE.

     Instead of returning a list of the backlinks of
     `org-roam-node-at-point', find the backlinks of NODE.  This is
     handy in cases where NODE is read through `org-roam-node-read'
     and doesn't have to be the `current-buffer'"
       (org-roam-db-query
	     [:select [source dest]
		      :from links
		      :where (= dest $s1)
		      :and (= type "id")]
	     (org-roam-node-id NODE)))

     (defun zetteldesk-roam-node-sort-by-backlinks (completion-a completion-b)
       "Sorting function for org-roam that sort the list of nodes.
     Sorting is done accordint to the number of backlinks.  This is
     the sorting function in `org-roam-node-find-by-backlinks' and
     `zetteldesk-node-insert-sort-backlinks'.  Arguments COMPLETION-A
     and COMPLETION-B are same as in
     `org-roam-node-read-sort-by-file-atime'"
       (let ((node-a (cdr completion-a))
	     (node-b (cdr completion-b)))
	 (>= (org-roam-node-backlinkscount-number node-a)
	     (org-roam-node-backlinkscount-number node-b))))

   #+END_SRC
   
