zetteldesk.el
;;; zetteldesk.el --- A revision and outlining tool for org-roam  -*- lexical-binding: t; -*-

;; Author: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
;; Maintainer: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
;; URL: https://github.com/Vidianos-Giannitsis/zetteldesk.el
;; Package-Requires: ((emacs "27.1") (org-roam "2.0"))
;; Tested on Emacs 27.2 and org-roam v2.2
;; Created: 6th February 2022
;; License: GPL-3.0
;; Version: 1.0.1

;; This file is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; For a full copy of the GNU General Public License
;; see <https://www.gnu.org/licenses/>.

;;; Commentary:

;; This package provides various filter functions to "traverse" your
;; org-roam database more smoothly.  I use it for doing revision in
;; lessons and I personally find it highly efficient for this
;; purpose.  Its also good to just sort out your thoughts.  In general,
;; org-roam lacks a good framework for filtering your nodes although
;; it has all the backend for doing that.

;;; Code:

;; -- DEPENDENCIES --
;; These are some functions that are needed for the package to work as
;; it should, but that are not specific to the package

(require 'org-roam)

(cl-defmethod org-roam-node-buffer ((node org-roam-node))
  "Access slot \"buffer\" of org-roam-node struct CL-X.
NODE is an org-roam-node"
  (let ((buffer (get-file-buffer (org-roam-node-file node))))
    buffer))

(cl-defmethod org-roam-node-backlinkscount-number ((node org-roam-node))
    "Access slot \"backlinks\" of org-roam-node struct CL-X.

This is identical to `org-roam-node-backlinkscount' with the
    difference that it returns a number instead of a fromatted
    string. This is to be used in
    `zetteldesk-roam-node-sort-by-backlinks'. NODE is an org-roam-node."
    (let* ((count (caar (org-roam-db-query
			 [:select (funcall count source)
				  :from links
				  :where (= dest $s1)
				  :and (= type "id")]
			 (org-roam-node-id node)))))
      count))

(defun zetteldesk-roam-node-poi-or-moc-p (NODE)
  "Check if NODE has the tag POI or the tag MOC.  Return t if it does."
  (or (string-equal (car (org-roam-node-tags NODE)) "POI")
      (string-equal (car (org-roam-node-tags NODE)) "MOC")))

(defun zetteldesk-roam-backlink-query ()
  "Simple org-roam query function.
Stores the IDs of all the files that link to the node at point.
This is a modified part of the `org-roam-backlinks-get' function
keeping only the part necessary for `org-roam-backlink-files' to
work as this is a complimentary function to that"
  (org-roam-db-query
   [:select [source dest]
	    :from links
	    :where (= dest $s1)
	    :and (= type "id")]
   (org-roam-node-id (org-roam-node-at-point))))

(defun zetteldesk-roam-backlink-query* (NODE)
  "Run `zetteldesk-roam-backlink-query' with NODE.

Instead of returning a list of the backlinks of
`org-roam-node-at-point', find the backlinks of NODE.  This is
handy in cases where NODE is read through `org-roam-node-read'
and doesn't have to be the `current-buffer'"
  (org-roam-db-query
	[:select [source dest]
		 :from links
		 :where (= dest $s1)
		 :and (= type "id")]
	(org-roam-node-id NODE)))

(defun zetteldesk-roam-node-sort-by-backlinks (completion-a completion-b)
  "Sorting function for org-roam that sort the list of nodes.
Sorting is done accordint to the number of backlinks.  This is
the sorting function in `org-roam-node-find-by-backlinks' and
`zetteldesk-node-insert-sort-backlinks'.  Arguments COMPLETION-A
and COMPLETION-B are same as in
`org-roam-node-read-sort-by-file-atime'"
  (let ((node-a (cdr completion-a))
	(node-b (cdr completion-b)))
    (>= (org-roam-node-backlinkscount-number node-a)
	(org-roam-node-backlinkscount-number node-b))))

;; -- PREDICATE FUNCTIONS --
