zetteldesk.el
;; This section contains the predicate functions the package uses. The
;; core of the package is that it provides well filtered completion
;; menus as chosen by the user, so obviously predicate functions are
;; core to the package

(defcustom zetteldesk-desktop
  "default"
  "Buffer local variable.
Checks if the current buffer is part of the zetteldesk.  A buffer
is part of the zetteldesk only if the value of this variable is
not its default value in that buffer."
  :type 'string
  :group 'zetteldesk
  :local t)

(defconst zetteldesk-desktop-default
  "default"
  "Default value of `zetteldesk-desktop'.

This stores the default value through a `defconst' so it can't be
modified to do a comparison between it and the current value of
`zetteldesk-desktop'.")

(defun zetteldesk-p (BUFFER)
  "Check if BUFFER is part of the current `zetteldesk-desktop'."
  (not (equal zetteldesk-desktop-default
	      (buffer-local-value 'zetteldesk-desktop (cdr BUFFER)))))

(defun zetteldesk-buffer-p (BUFFER)
  "Check if BUFFER is part of the current `zetteldesk-desktop'.
Then check if BUFFER is not associated to an org-roam file.

Org-roam file buffers are better viewed with `org-roam-node-file'
so this function filters down the database to non org-roam
zetteldesk buffers.  This is what is used to create the filter
function `zetteldesk-switch-to-buffer'"
  (and (zetteldesk-p BUFFER) (not (org-roam-buffer-p (cdr BUFFER)))))

(defun zetteldesk-node-p (NODE)
  "Check if NODE is associated with an open buffer.
If it is, check if that buffer is part of the current
`zetteldesk-desktop'.  If it isn't, return nil.

This function is used as a filter function to create
`zetteldesk-node-find' which is a filtered view of
`org-roam-node-find'"
  (if (org-roam-node-buffer NODE)
      (not (equal zetteldesk-desktop-default
		  (buffer-local-value 'zetteldesk-desktop (org-roam-node-buffer NODE))))
    nil))

(defmacro zetteldesk-mode-buffer-p (BUFFER MODE)
  "Check if BUFFER is part of the `zetteldesk-desktop' and in `major-mode' MODE.

This macro is meant to be used to write filter functions to be
passed to `read-buffer' variants such as
`zetteldesk-org-buffer-p' which is used in
`zetteldesk-insert-org-file-contents'.  BUFFER is in the form
required for `read-buffer' while MODE should be a symbol such as
'org-mode."
  `(and (zetteldesk-buffer-p ,BUFFER)
	(equal (buffer-local-value 'major-mode (cdr ,BUFFER)) ,MODE)))

(defun zetteldesk-org-buffer-p (BUFFER)
  "Check if BUFFER is part of the current `zetteldesk-desktop'.
Then check if the file is an org file but not one that belongs to
org-roam.

This is used as the filter function for
`zetteldesk-insert-org-file-contents' which prompts for an org
file, but as `zetteldesk-insert-node-contents' is a superior
version for org-roam nodes, that function should not prompts for
those files"
  (zetteldesk-mode-buffer-p BUFFER 'org-mode))

(defun zetteldesk-pdf-p (BUFFER)
  "Check if BUFFER is part of the current `zetteldesk-desktop' and also a pdf file."
  (zetteldesk-mode-buffer-p BUFFER 'pdf-view-mode))
