zetteldesk.el

;; -- ADD/REMOVE THINGS IN THE ZETTELDESK --
;; To get a system where the user can get multiple filtered views of
;; the nodes/buffers of their choice, obviously you need functions
;; that allow the user to add them to something. And then, you also
;; need ways to remove things, because people make mistakes.

(defmacro zetteldesk--add-buffer (BUFFER)
  "Add BUFFER to the current `zetteldesk-desktop'.

This is a low-level macro used in all zetteldesk-add
functions.  Given BUFFER it creates the code required to add the
buffer to the zetteldesk.  For example all
`zetteldesk-add-to-desktop' is, is an interactive call to this
macro.  Other functions need more stuff, but deep-down they all
use this macro."
  `(with-current-buffer ,BUFFER
     (setq-local zetteldesk-desktop "foo")))

(defun zetteldesk-add-to-desktop (BUFFER)
  "Add BUFFER to the current `zetteldesk-desktop'."
  (interactive "b")
  (zetteldesk--add-buffer BUFFER))

(defun zetteldesk-add-node-to-desktop (NODE)
  "Add NODE to the `zetteldesk-desktop'.
If there isn't a buffer associated to it, create it.  NODE is an
org-roam node read through `org-roam-node-read'"
  (interactive (list (org-roam-node-read)))
  (let ((buffer (org-roam-node-buffer NODE))
	 (file (org-roam-node-file NODE))
	 (org-startup-with-latex-preview nil))
    (if buffer
	(zetteldesk--add-buffer buffer)
      (zetteldesk--add-buffer (find-file-noselect file)))))

(defun zetteldesk-add-poi-or-moc-backlink-to-desktop ()
  "Prompt the user to select an org-roam node that has a specific tag.
Looks for the POI or MOC tag (filtering done with
`zetteldesk-roam-node-poi-or-moc-p') and collects its ID and backlinks.
Then, prompt the user to select one of its backlinks and add that
to the zetteldesk."
  (interactive)
  (let* ((source (org-roam-node-read nil #'zetteldesk-roam-node-poi-or-moc-p))
	 (source-id (org-roam-node-id source))
	 (backlinks (zetteldesk-roam-backlink-query* source)))
    (zetteldesk-add-node-to-desktop
     (org-roam-node-read nil (lambda (NODE)
			       (let* ((id (org-roam-node-id NODE))
				      (id-list (list id source-id)))
				 (member id-list backlinks)))))))

(defun zetteldesk-add-backlinks-to-desktop ()
  "Add the current buffer and all its backlinks to the `zetteldesk-desktop'.

This function queries the database for all the nodes that link to
the current node with the `zetteldesk-roam-backlink-query' function and
then recursively checks if there is an open buffer associated
with them, and if so adds it to the `zetteldesk-desktop'"
  (interactive)
  (setq-local zetteldesk-desktop "foo")
  (let ((backlinks (length (zetteldesk-roam-backlink-query)))
	(org-startup-with-latex-preview nil))
    (dotimes (number backlinks)
      (let* ((id (car (nth number (zetteldesk-roam-backlink-query))))
	      (node (org-roam-node-from-id id))
	      (buffer (org-roam-node-buffer node))
	      (file (org-roam-node-file node)))
	(if buffer
	    (zetteldesk--add-buffer buffer)
	  (zetteldesk--add-buffer (find-file-noselect file)))))))

(defmacro zetteldesk--remove-buffer (BUFFER)
  "Remove BUFFER from the current `zetteldesk-desktop'.

This is a low-level macro used in all zetteldesk-remove
functions.  This function is identical in logic to
`zetteldesk--add-buffer', however it is for removing thingss
instead of adding."
  `(with-current-buffer ,BUFFER
     (kill-local-variable 'zetteldesk-desktop)))

(defun zetteldesk-remove-from-desktop (BUFFER)
  "Remove BUFFER from the current `zetteldesk-desktop'."
  (interactive "b")
  (zetteldesk--remove-buffer BUFFER))

(defun zetteldesk-remove-node-from-desktop (NODE)
  "Remove NODE from the `zetteldesk-desktop'.
NODE is an org-roam node
and is read through `org-roam-node-read'"
  (interactive (list (org-roam-node-read nil #'zetteldesk-node-p)))
  (let ((buffer (org-roam-node-buffer NODE)))
    (zetteldesk--remove-buffer buffer)))

(defun zetteldesk-remove-backlinks-from-desktop ()
  "Remove from the `zetteldesk-desktop', the current buffer and its backlinks.

This function is essentially a carbon copy of
`zetteldesk-add-backlinks-to-desktop' but instead of adding the
buffer to the desktop it removes it."
  (interactive)
  (kill-local-variable 'zetteldesk-desktop)
  (let ((backlinks (length (zetteldesk-roam-backlink-query))))
    (dotimes (number backlinks)
      (let* ((id (car (nth number (zetteldesk-roam-backlink-query))))
	      (node (org-roam-node-from-id id))
	      (buffer (org-roam-node-buffer node)))
	(when buffer
	  (zetteldesk--remove-buffer buffer))))))

;; -- FILTER FUNCTIONS --
;; This section is about defining all the functions that show you the
;; filtered results of all your nodes/buffers

(defun zetteldesk-switch-to-buffer ()
  "Execute a filtered `switch-to-buffer'.
The filter is done using `zetteldesk-buffer-p' to show only
buffers that are part of the current `zetteldesk-desktop' and not
`org-roam-node's."
  (interactive)
  (switch-to-buffer (read-buffer "Zetteldesk Buffers: " nil nil #'zetteldesk-buffer-p)))

(defun zetteldesk-node-find ()
  "Execute a filtered `org-roam-node-find'.
The filter is done using `zetteldesk-node-p' to show only nodes that are
part of the current `zetteldesk-desktop'"
  (interactive)
  (org-roam-node-find nil nil #'zetteldesk-node-p))

(defun zetteldesk-node-insert ()
  "Execute a filtered `org-roam-node-insert'.
The filter is done using `zetteldesk-node-p' to show only nodes that are
part of the current `zetteldesk-desktop'"
  (interactive)
  (org-roam-node-insert #'zetteldesk-node-p))

(defun zetteldesk-node-insert-sort-backlinks ()
  "Select a node that is part of the zetteldesk.
The function used is `org-roam-node-read' in a UI sorted by the
  number of backlinks.  Insert a link in the current buffer to
  the selected node.

This function essentially has the core functionality of
`org-roam-node-insert', but it uses `org-roam-node-read' instead
as only that can take a sort-function.  Some files may be
important to their topic, but not MOCs or POIs, so this function
acts essentially as a complimentary function to
`zetteldesk-node-insert-if-poi-or-moc' to check if that one
missed something you want to include."
  (interactive)
  (let* ((node (org-roam-node-read nil #'zetteldesk-node-p #'zetteldesk-roam-node-sort-by-backlinks))
	 (id (org-roam-node-id node))
	 (description (org-roam-node-formatted node)))
    (insert (org-link-make-string
	     (concat "id:" id)
	     description))))

;; -- *ZETTELDESK-SCRATCH* --
