zetteldesk.org
** On the zetteldesk-scratch buffer
   The zetteldesk-scratch buffer is a bit equivalent to the emacs scratch buffer. Its essentially a buffer unique to the session in which you can drop all the links, node contents or whatever else interests you and use it as the place to hold your crude notes until you drop them where they belong. I also envision this to be the buffer in which you drop all the notes you want to view at one time, in the way you would spread them on your desk.

   I am considering making a global minor mode zetteldesk-mode in which map you can put all your keybindings if you do not want the override map littered with those. It will also have a hook when turned on to create the scratch buffer. I will do this as I find it more classy to enable a minor mode than to just run the zetteldesk-create-scratch-buffer at initialization

   Things I have implemented so far
   - Creating a global minor mode for the zetteldesk.
   - Creating a function which initialises the zetteldesk-scratch buffer and hook that to the on-hook of zetteldesk-mode. The primary reason for wanting to define the minor mode was to enable it on startup and have this hook initialise the scratch buffer so I do not have to worry about it. The other reason is that for distributing this as a package I think it makes sense for it to have a minor mode in which I could possibly isolate the keybindings.
   - A function that inserts links to all the POIs in the zetteldesk to the current buffer. The way I have my zettelkasten sorted, my index files have the MOC (map of contents) tag and other important files of a subject have the POI (point of interest) tag. POIs are chosen by opening org-roam UI, blacklisting index files (in my case blacklisting the MOC tag), having a high value for "Node connections size scale" and seeing which nodes stand out the most. This is an idea taken from the book How to make a complete map of every thought you think. I use my zettelkasten for university notes and when revisioning its a great tool to be able to insert links to all POIs in some sort of scratch buffer, then sorting them and with that writing an outline of everything in that lesson. In a way, this does function as an outliner tool.
   - A function that prompts for a node inside the zetteldesk and inserts its contents to the zetteldesk-scratch buffer omitting the properties section where the id is stored. As it uses an absolute number for this, it doesn't exactly omit properties if the node has aliases or refs, I could consider trying to fix that, but I do not know how as of now. It also replaces the title keyword with a top level heading. This way you can add any node to your scratch buffer. This is equivalent to taking the note out of the drawer and putting it into your desk, the very first part of what I plan for this tool.
   - A similar function which prompts for org files in the zetteldesk but excluding org-roam files. Its behaviour is a bit different. No links are inserted as they are not needed, no part of the file is truncated as typically the first line is the title, the title is again changed to a top level heading, but as most big org files have some kind of structure to them, I also demote all their headings by 1, as their top level heading will be the title. This is part of an idea I had that this system should integrate with more than org-roam files (albeit that being the main plan) because your notes could also be in other org files.
   - A function that prompts the user to select a pdf that is part of the zetteldesk and a page in that pdf and inserts a link to that pdf, in that page. The link sits under a heading which has a specifically formatted name of the type "Supplementary Material - name_of_pdf (PDF)". Also has functionality of inserting the highlighted region of text to the zetteldesk-scratch buffer.

   Only other supportive material for any kind of work/research I could think of is source code files and browser pages. For source code files, it is in my opinion trivial to paste the code into an org mode source code block. I might automate it a bit better in the future, but for now I am not that interested in setting up something like this. For web pages, there really wouldn't be a point in inserting the web page verbatim, but only a link and some notes about it. This is already handled by org-roam protocol and that capture template of mine so if anything I will mention it and prompt to that capture template for what I think it should have. There is also screenshots and MS Office formats I guess but screenshots can be pasted into an org file from the clipboard and therefore require no automation and all MS Office formats aren't that readable in Emacs in the first place so they should be converted to pdf and handled by that imo. 

   #+BEGIN_SRC elisp :tangle zetteldesk.el

     ;; -- *ZETTELDESK-SCRATCH* --
     ;; This is the section where it all comes together. The
     ;; zetteldesk-scratch buffer is a special buffer defined here on which
     ;; you drop all your stuff. Its what molds the whole workflow together

     (defcustom zetteldesk-kb-map (make-sparse-keymap)
       "This variable is the keymap for `zetteldesk-mode'."
       :type 'keymap
       :group 'zetteldesk)

     (defcustom zetteldesk-insert-scratch-or-current-buffer t
       "Customization variable.
     Decides whethere zetteldesk-insert functions will insert to the
     ,*zetteldesk-scratch* buffer or the current buffer.  Default value
     is t which makes those functions insert to the scratch.  Setting
     it to nil will make those functions insert to the current buffer,
     for whichever usecase you might want"
       :type 'string
       :group 'zetteldesk)

     (defun zetteldesk--create-scratch-buffer ()
       "Create the zetteldesk-scratch buffer and put it in `org-mode'."
       (let ((buffer (generate-new-buffer "*zetteldesk-scratch*"))
	     (org-startup-with-latex-preview nil))
	 (with-current-buffer buffer
	   (org-mode))))

     ;;;###autoload
     (define-minor-mode zetteldesk-mode
       "Toggles the global `zetteldesk-mode'.

     When turned on, this mode initialises the *zetteldesk-scratch*
     buffer, a useful part of the whole zetteldesk workflow."
       :init-value nil
       :global t
       :group 'zetteldesk
       :keymap zetteldesk-kb-map
       :lighter " zetteldesk"
       (when zetteldesk-mode
	 (zetteldesk--create-scratch-buffer)))

     (defmacro zetteldesk-insert-location ()
       "Find the location the zetteldesk-insert functions should insert to.

     The decision is made depending on the variable
     `zetteldesk-insert-scratch-or-current-buffer'.  Check its
     docstring for more info.  This is used in all zetteldesk-insert
     functions to decide if the insertion should happen in
     ,*zetteldesk-scratch or the current buffer."
       `(if zetteldesk-insert-scratch-or-current-buffer
		       "*zetteldesk-scratch*"
		     (current-buffer)))

     (defmacro zetteldesk-insert-switch-to-scratch (arg)
       "Switch to the *zetteldesk-scratch* if ARG is the `\\[universal-argument]'.

     All the zetteldesk-insert functions have a similar logic of
     switching to the *zetteldesk-scratch* buffer in a split if given
     a `\\[universal-argument]'.  To avoid repetition, this macro
     expands to the needed code."
       `(when (equal ,arg '(4))
	  (switch-to-buffer-other-window "*zetteldesk-scratch*")))

     (defmacro zetteldesk--replace-title ()
       "Replace \"#+title: \" with \"* \".

     A lot of the zetteldesk-insert functions need this functionality
     so I implemented it as a simple macro."
       `(while (search-forward "#+title: " nil t)
	  (replace-match "* " nil t)))

     (defun zetteldesk-switch-to-scratch-buffer (&optional arg)
       "Open the zetteldesk-scratch buffer in a split with the current buffer.

     Optionally, if given optional argument ARG, which needs to be the
     `\\[universal-argument]' switch to the *zetteldesk-scratch*
     buffer without issuing a split."
       (interactive "P")
       (if (equal arg '(4))
	   (switch-to-buffer "*zetteldesk-scratch*")
	 (switch-to-buffer-other-window "*zetteldesk-scratch*")))

     (defun zetteldesk-node-insert-if-poi-or-moc ()
       "Filter `org-roam-node-list' to show zetteldesk-nodes only.
     Then filter that to only those that have the POI or MOC tag with
     `zetteldesk-node-p' and `zetteldesk-roam-node-poi-or-moc-p'.  Then
     insert a link to every one of those nodes and seperate them with
     commas"
       (interactive)
       (let* ((init_list (org-roam-node-list))
	      (zetteldesk_nodes (cl-remove-if-not #'zetteldesk-node-p init_list))
	      (nodes_poi (cl-remove-if-not #'zetteldesk-roam-node-poi-or-moc-p zetteldesk_nodes)))
	 (while nodes_poi
	   (let* ((node (car nodes_poi))
		  (description (org-roam-node-formatted node)))
	     (insert (org-link-make-string
		      (concat "id:" (org-roam-node-id node))
		      description))
	     (insert ", "))
	   (setq nodes_poi (cdr nodes_poi)))))

     (defun zetteldesk-insert-node-contents (&optional arg)
       "Select a node that is part of the current `zetteldesk-desktop'.
     Add a link to it at point and then insert its contents to the
     bottom of the *zetteldesk-scratch* buffer after inserting a
     newline there.  Remove the first 67 characters which is the
     properties section if it only contains the ID of the node as its
     unneeded and change the string #+title to a top level heading as
     its more practical when inserting the contents of multiple files.

     If given the optional argument ARG, which needs to be the
     `\\[universal-argument]' also switch to the *zetteldesk-scratch*
     buffer in a split."
       (interactive "P")
       (let* ((node (org-roam-node-read nil #'zetteldesk-node-p))
	      (file (org-roam-node-file node))
	      (description (org-roam-node-formatted node))
	      (location (zetteldesk-insert-location)))
	 (insert (org-link-make-string
		  (concat "id:" (org-roam-node-id node))
		  description))
	 (with-current-buffer location
	   (goto-char (point-max))
	   (newline)
	   (insert-file-contents file nil 67)
	   (zetteldesk--replace-title)))
       (zetteldesk-insert-switch-to-scratch arg))

     (defun zetteldesk-insert-node-contents-without-link ()
       "\"Sister function\" of `zetteldesk-insert-node-contents'.
     Finds a node that is part of the `zetteldesk-desktop' and inserts its
     contents to the bottom of the zetteldesk-scratch buffer. This
     function differentiates itself, by the fact that it doesn't
     insert an ID link to the node in the current buffer and by the
     fact that it switches to the scratch buffer in a split without
     needing a `\\[universal-argument]'.

     For me, it makes sense a lot of the time to insert a link to the
     node inthe current buffer, especially if its an outlining
     buffer. But sometimes its not handy, and so, I just made this
     second iteration to fix that issue."
       (interactive)
       (let* ((node (org-roam-node-read nil #'zetteldesk-node-p))
	      (location (zetteldesk-insert-location))
	      (file (org-roam-node-file node)))
	 (with-current-buffer location
	   (goto-char (point-max))
	   (newline)
	   (insert-file-contents file nil 67)
	   (zetteldesk--replace-title)))
       (switch-to-buffer-other-window "*zetteldesk-scratch*"))

     (defun zetteldesk-insert-org-file-contents (&optional arg)
       "Select an org buffer that is in the `zetteldesk-desktop'.
     Insert its contents to the *zetteldesk-scratch* buffer, make its
      title a top level heading and demote all of its headings by one
      level (since the title now acts as a top level heading).  Note
      that org-roam nodes are not shown

     Optional argument ARG, if given needs to be a
     `\\[universal-argument]' and it switches to the *zetteldesk-scratch*
     buffer in a split"
       (interactive "P")
       (let* ((buffer (set-buffer (read-buffer "Zetteldesk Buffers: " nil nil #'zetteldesk-org-buffer-p)))
	      (location (zetteldesk-insert-location))
	      (file (buffer-file-name buffer)))
	 (set-buffer location)
	 (goto-char (point-max))
	 (save-excursion
	   (newline)
	   (insert-file-contents file))
	 (save-excursion
	   (while (not (org-next-visible-heading 1))
	     (org-metaright)))
	 (zetteldesk--replace-title))
       (zetteldesk-insert-switch-to-scratch arg))

     (defun zetteldesk-insert-link-to-pdf (&optional arg)
       "Select a pdf file that is part of the `zetteldesk-desktop'.
     Prompt for a page in that pdf (defaults to page 1 if you don't
     care about the page).

     Then, in the zetteldesk-scratch buffer, insert at `point-max' a
     newline and then a new heading with its name consisting of the
     string \"Supportive Material - \" then the pdfs name, without the
     file structure or the extension and then the string
     \"(PDF)\".  Then, insert a newline, the string \"Link to PDF: \"
     and then a link to the chosen pdf, in the correct page, with the
     description being the pdfs name without the file structure or the
     extension.  Note that `org-pdftools-setup-link' needs to be run
     for pdf links to work (which this uses).

     Optionally, if given optional argument ARG which is the
     `\\[universal-argument]' save the highlighted region in a
     variable and insert it after the heading but before the pdf link.
     This functionality serves the purpose of adding a \"description\"
     sort of thing to the pdf. Typically, when citing a pdf as
     supplementary info to an argument, there is something specific
     you want to take from the pdf. Therefore, this optional addition,
     adds that to the scratch buffer so you remember why it was
     useful."
       (interactive "P")
       (let* ((pdf-buffer (set-buffer (read-buffer "Zetteldesk Pdfs: " nil nil #'zetteldesk-pdf-p)))
	      (file (buffer-file-name pdf-buffer))
	      (location (zetteldesk-insert-location))
	      (page (read-from-minibuffer "Page: " "1"))
	      (description (file-name-nondirectory (file-name-sans-extension file))))
	 (with-current-buffer location
	   (goto-char (point-max))
	   (newline)
	   (org-insert-heading)
	   (insert "Supportive Material - " description " (PDF)")
	   (newline)
	   (when (equal arg '(4))
	     (let ((contents (buffer-substring (mark) (point))))
	       (insert contents)
	       (newline)))
	   (insert "Link to PDF: "
		   (org-link-make-string
		    (concat "pdf:" file "::" page)
		    description)))))


   #+END_SRC

   #+RESULTS:
   : zetteldesk-insert-link-to-pdf

