zetteldesk.el
;; This is the section where it all comes together. The
;; zetteldesk-scratch buffer is a special buffer defined here on which
;; you drop all your stuff. Its what molds the whole workflow together

(defcustom zetteldesk-kb-map (make-sparse-keymap)
  "This variable is the keymap for `zetteldesk-mode'."
  :type 'keymap
  :group 'zetteldesk)

(defcustom zetteldesk-insert-scratch-or-current-buffer t
  "Customization variable.
Decides whethere zetteldesk-insert functions will insert to the
*zetteldesk-scratch* buffer or the current buffer.  Default value
is t which makes those functions insert to the scratch.  Setting
it to nil will make those functions insert to the current buffer,
for whichever usecase you might want"
  :type 'string
  :group 'zetteldesk)

(defun zetteldesk--create-scratch-buffer ()
  "Create the zetteldesk-scratch buffer and put it in `org-mode'."
  (let ((buffer (generate-new-buffer "*zetteldesk-scratch*"))
	(org-startup-with-latex-preview nil))
    (with-current-buffer buffer
      (org-mode))))

;;;###autoload
(define-minor-mode zetteldesk-mode
  "Toggles the global `zetteldesk-mode'.

When turned on, this mode initialises the *zetteldesk-scratch*
buffer, a useful part of the whole zetteldesk workflow."
  :init-value nil
  :global t
  :group 'zetteldesk
  :keymap zetteldesk-kb-map
  :lighter " zetteldesk"
  (when zetteldesk-mode
    (zetteldesk--create-scratch-buffer)))

(defmacro zetteldesk-insert-location ()
  "Find the location the zetteldesk-insert functions should insert to.

The decision is made depending on the variable
`zetteldesk-insert-scratch-or-current-buffer'.  Check its
docstring for more info.  This is used in all zetteldesk-insert
functions to decide if the insertion should happen in
*zetteldesk-scratch or the current buffer."
  `(if zetteldesk-insert-scratch-or-current-buffer
		  "*zetteldesk-scratch*"
		(current-buffer)))

(defmacro zetteldesk-insert-switch-to-scratch (arg)
  "Switch to the *zetteldesk-scratch* if ARG is the `\\[universal-argument]'.

All the zetteldesk-insert functions have a similar logic of
switching to the *zetteldesk-scratch* buffer in a split if given
a `\\[universal-argument]'.  To avoid repetition, this macro
expands to the needed code."
  `(when (equal ,arg '(4))
     (switch-to-buffer-other-window "*zetteldesk-scratch*")))

(defmacro zetteldesk--replace-title ()
  "Replace \"#+title: \" with \"* \".

A lot of the zetteldesk-insert functions need this functionality
so I implemented it as a simple macro."
  `(while (search-forward "#+title: " nil t)
     (replace-match "* " nil t)))

(defun zetteldesk-switch-to-scratch-buffer (&optional arg)
  "Open the zetteldesk-scratch buffer in a split with the current buffer.

Optionally, if given optional argument ARG, which needs to be the
`\\[universal-argument]' switch to the *zetteldesk-scratch*
buffer without issuing a split."
  (interactive "P")
  (if (equal arg '(4))
      (switch-to-buffer "*zetteldesk-scratch*")
    (switch-to-buffer-other-window "*zetteldesk-scratch*")))

(defun zetteldesk-node-insert-if-poi-or-moc ()
  "Filter `org-roam-node-list' to show zetteldesk-nodes only.
Then filter that to only those that have the POI or MOC tag with
`zetteldesk-node-p' and `zetteldesk-roam-node-poi-or-moc-p'.  Then
insert a link to every one of those nodes and seperate them with
commas"
  (interactive)
  (let* ((init_list (org-roam-node-list))
	 (zetteldesk_nodes (cl-remove-if-not #'zetteldesk-node-p init_list))
	 (nodes_poi (cl-remove-if-not #'zetteldesk-roam-node-poi-or-moc-p zetteldesk_nodes)))
    (while nodes_poi
      (let* ((node (car nodes_poi))
	     (description (org-roam-node-formatted node)))
	(insert (org-link-make-string
		 (concat "id:" (org-roam-node-id node))
		 description))
	(insert ", "))
      (setq nodes_poi (cdr nodes_poi)))))

(defun zetteldesk-insert-node-contents (&optional arg)
  "Select a node that is part of the current `zetteldesk-desktop'.
Add a link to it at point and then insert its contents to the
bottom of the *zetteldesk-scratch* buffer after inserting a
newline there.  Remove the first 67 characters which is the
properties section if it only contains the ID of the node as its
unneeded and change the string #+title to a top level heading as
its more practical when inserting the contents of multiple files.

If given the optional argument ARG, which needs to be the
`\\[universal-argument]' also switch to the *zetteldesk-scratch*
buffer in a split."
  (interactive "P")
  (let* ((node (org-roam-node-read nil #'zetteldesk-node-p))
	 (file (org-roam-node-file node))
	 (description (org-roam-node-formatted node))
	 (location (zetteldesk-insert-location)))
    (insert (org-link-make-string
	     (concat "id:" (org-roam-node-id node))
	     description))
    (with-current-buffer location
      (goto-char (point-max))
      (newline)
      (insert-file-contents file nil 67)
      (zetteldesk--replace-title)))
  (zetteldesk-insert-switch-to-scratch arg))

(defun zetteldesk-insert-node-contents-without-link ()
  "\"Sister function\" of `zetteldesk-insert-node-contents'.
Finds a node that is part of the `zetteldesk-desktop' and inserts its
contents to the bottom of the zetteldesk-scratch buffer. This
function differentiates itself, by the fact that it doesn't
insert an ID link to the node in the current buffer and by the
fact that it switches to the scratch buffer in a split without
needing a `\\[universal-argument]'.

For me, it makes sense a lot of the time to insert a link to the
node inthe current buffer, especially if its an outlining
buffer. But sometimes its not handy, and so, I just made this
second iteration to fix that issue."
  (interactive)
  (let* ((node (org-roam-node-read nil #'zetteldesk-node-p))
	 (location (zetteldesk-insert-location))
	 (file (org-roam-node-file node)))
    (with-current-buffer location
      (goto-char (point-max))
      (newline)
      (insert-file-contents file nil 67)
      (zetteldesk--replace-title)))
  (switch-to-buffer-other-window "*zetteldesk-scratch*"))

(defun zetteldesk-insert-org-file-contents (&optional arg)
  "Select an org buffer that is in the `zetteldesk-desktop'.
Insert its contents to the *zetteldesk-scratch* buffer, make its
 title a top level heading and demote all of its headings by one
 level (since the title now acts as a top level heading).  Note
 that org-roam nodes are not shown

Optional argument ARG, if given needs to be a
`\\[universal-argument]' and it switches to the *zetteldesk-scratch*
buffer in a split"
  (interactive "P")
  (let* ((buffer (set-buffer (read-buffer "Zetteldesk Buffers: " nil nil #'zetteldesk-org-buffer-p)))
	 (location (zetteldesk-insert-location))
	 (file (buffer-file-name buffer)))
    (set-buffer location)
    (goto-char (point-max))
    (save-excursion
      (newline)
      (insert-file-contents file))
    (save-excursion
      (while (not (org-next-visible-heading 1))
	(org-metaright)))
    (zetteldesk--replace-title))
  (zetteldesk-insert-switch-to-scratch arg))

(defun zetteldesk-insert-link-to-pdf (&optional arg)
  "Select a pdf file that is part of the `zetteldesk-desktop'.
Prompt for a page in that pdf (defaults to page 1 if you don't
care about the page).

Then, in the zetteldesk-scratch buffer, insert at `point-max' a
newline and then a new heading with its name consisting of the
string \"Supportive Material - \" then the pdfs name, without the
file structure or the extension and then the string
\"(PDF)\".  Then, insert a newline, the string \"Link to PDF: \"
and then a link to the chosen pdf, in the correct page, with the
description being the pdfs name without the file structure or the
extension.  Note that `org-pdftools-setup-link' needs to be run
for pdf links to work (which this uses).

Optionally, if given optional argument ARG which is the
`\\[universal-argument]' save the highlighted region in a
variable and insert it after the heading but before the pdf link.
This functionality serves the purpose of adding a \"description\"
sort of thing to the pdf. Typically, when citing a pdf as
supplementary info to an argument, there is something specific
you want to take from the pdf. Therefore, this optional addition,
adds that to the scratch buffer so you remember why it was
useful."
  (interactive "P")
  (let* ((pdf-buffer (set-buffer (read-buffer "Zetteldesk Pdfs: " nil nil #'zetteldesk-pdf-p)))
	 (file (buffer-file-name pdf-buffer))
	 (location (zetteldesk-insert-location))
	 (page (read-from-minibuffer "Page: " "1"))
	 (description (file-name-nondirectory (file-name-sans-extension file))))
    (with-current-buffer location
      (goto-char (point-max))
      (newline)
      (org-insert-heading)
      (insert "Supportive Material - " description " (PDF)")
      (newline)
      (when (equal arg '(4))
	(let ((contents (buffer-substring (mark) (point))))
	  (insert contents)
	  (newline)))
      (insert "Link to PDF: "
	      (org-link-make-string
	       (concat "pdf:" file "::" page)
	       description)))))
