zetteldesk.org
** Save the state of the zetteldesk
Saving the current state of the ~zetteldesk-desktop~ could be a very useful feature. This code tries to implement this feature to zetteldesk.el. The function ~zetteldesk-save-state~ saves the state of a desktop with an identifier for it by adding the code to add it to the list ~zetteldesk-saved-states~ to an elisp file that should be in your load-path and required in your init.el. Then, the desktop can be restored using ~zetteldesk-restore-desktop~ in a new session.

#+BEGIN_SRC elisp :tangle zetteldesk.el

  (defcustom zetteldesk-saved-states '()
    "List of lists of buffers storing saved states of `zetteldesk-desktop'.

  Each item in the list is a list of buffers. The function
  `zetteldesk-save-state' inserts the code to add the list of
  buffers currently in the `zetteldesk-desktop' to this list."
    :type 'list
    :group 'zetteldesk)

  (defcustom zetteldesk-saved-state-file
    (concat user-emacs-directory "libs/zetteldesk-saves.el")
    "Location in which zetteldesk.el saves its desktops.

  Saving is done with `zetteldesk-save-state' and is stored in this
  file so it can be restored in later sessions with
  `zetteldesk-restore-desktop'."
    :type 'string
    :group 'zetteldesk)

  (defun zetteldesk-p* (BUFFER)
    "Check if BUFFER is part of the current `zetteldesk-desktop'."
    (not (equal zetteldesk-desktop-default
		(buffer-local-value 'zetteldesk-desktop BUFFER))))

  (defun zetteldesk-buffer-list ()
    "Make a list of all buffers that are part of the current `zetteldesk-desktop'.

  Also prompt for the identifier of the desktop so it can be
  recognized. This function is not meant to be used directly but be
  passed to `zetteldesk-save-state'. The identifier is to be used
  when restoring the desktop with `zetteldesk-restore-desktop'."
    (let ((identifier (read-string "Identifier for desktop: ")))
      (cons identifier
	    (cl-loop for buffer in (buffer-list)
		     if (zetteldesk-p* buffer)
		     collect (buffer-file-name buffer)))))

  (defun zetteldesk-save-state ()
    "Save the state of the current `zetteldesk-desktop'.

  This function uses `zetteldesk-buffer-list' as its main helper
  function. It collects a list of files who are part of the curent
  `zetteldesk-desktop' and adds an identifier to them so the state
  can be later restored. What it does is insert an `add-to-list'
  statement to the file that `zetteldesk-saved-state-file' points
  to, which adds the contents of the list returned by
  `zetteldesk-buffer-list' to `zetteldesk-saved-states'.

  If `zetteldesk-saved-state-file' is required in your init.el,
  zetteldesk will remember your saved states and it will be able to
  restore them with `zetteldesk-restore-desktop'."
    (interactive)
    (with-current-buffer (find-file-noselect zetteldesk-saved-state-file)
      (goto-char (point-max))
      (previous-line)
      (insert (format "%S" `(add-to-list 'zetteldesk-saved-states ',(zetteldesk-buffer-list))))
      (newline)
      (save-buffer)))

  (defun zetteldesk-add-file-to-desktop (FILE)
    "Add FILE to the current `zetteldesk-desktop'.

  If FILE is not associated to a buffer, read it in a buffer and
  add the resulting buffer to the `zetteldesk-desktop'. This
  function is not meant to be used interactively as it would be
  impractical. It is primarily for use in
  `zetteldesk-restore-desktop'."
    (let ((buffer (get-file-buffer FILE))
	  (org-startup-with-latex-preview nil))
      (if buffer
	  (zetteldesk--add-buffer buffer)
	(zetteldesk--add-buffer (find-file-noselect FILE)))))

  (defun zetteldesk-restore-desktop ()
    "Restore a saved state of the `zetteldesk-desktop'.

  The state must be saved to `zetteldesk-saved-states' using
  `zetteldesk-save-state' and the user is prompted to select a
  state using its identifier."
    (interactive)
    (mapcar #'zetteldesk-add-file-to-desktop
	    (cdr (assoc (completing-read "Save-State: " zetteldesk-saved-states)
			zetteldesk-saved-states))))

#+END_SRC
   
** Multiple scratches
The idea of having multiple zetteldesk-scratch buffers in one session and being able to select which is active or not in a given time is an interesting concept as mentioned in an issue. It simulates having multiple desks and placing different things in each. I personally haven't found the need for it, but it makes sense why it would be useful.

Multiple desktops means a few things:

- First write the current desktop to a file (write-file)
- Run the scratch initialization function to create a new desktop (zetteldesk--create-scratch-buffer)
- Store the old one in a variable
- Have a function to switch between desktops

  The first three can be done with the same top level function. Out of the three, only the third needs to be written here. Of the function below, the first is this implementation, while the other two are switching functions with different behaviour on the current scratch.

#+BEGIN_SRC elisp :tangle zetteldesk.el

  (defcustom zetteldesk-scratch-list '()
    "List of saved zetteldesk-scratch buffers.

  Each item in this list is added to it via the functions
  `zetteldesk-create-new-desktop' or
  `zetteldesk-store-active-desktop-and-switch' and is a buffer name
  of an inactive zetteldesk-scratch buffer that those functions
  saved."
    :type 'list
    :group 'zetteldesk)

  (defun zetteldesk-create-new-scratch (file)
    "Create a new zetteldesk-scratch buffer.

  This function initially prompts for a file to write the current
  zetteldesk-scratch to so it is not lost when replacing it.  It
  then stores its name and file as a cons cell to
  `zetteldesk-scratch-list'.  Finally, it creates a new
  zetteldesk-scratch buffer, with the low-level
  `zetteldesk--create-scratch-buffer' function, which is empty."
    (interactive "F")
    (let* ((name (read-string "Name of old desktop: "))
	   (cell (cons name file)))
      (with-current-buffer "*zetteldesk-scratch*"
	(write-file file))
      (push cell zetteldesk-desktop-list)
      (zetteldesk--create-scratch-buffer)))

  (defun zetteldesk-store-active-scratch-and-switch (file)
    "Store the active zetteldesk-scratch buffer and switch to an inactive one.

  This function initializes with `zetteldesk-create-new-scratch'
  but inserts the contents of an inactive scratch to the newly
  initialized one instead of keeping it empty.

  The function prompts the user for an inactive zetteldesk-scratch
  stored in `zetteldesk-scratch-list' and inserts its contents to
  the new zetteldesk-scratch, making it the active
  zetteldesk-scratch buffer."
    (interactive "F")
    (zetteldesk-create-new-scratch file)
    (with-current-buffer "*zetteldesk-scratch*"
      (insert-file-contents (cdr (assoc
				  (completing-read "Select desktop to activate: "
						   zetteldesk-desktop-list)
				  zetteldesk-desktop-list)))))

  (defun zetteldesk-delete-active-scratch-and-switch ()
    "Switch the active zetteldesk-scratch buffer deleting the current.

  This function is a sister function of
  `zetteldesk-store-active-desktop-and-switch' with their main
  difference being that this function deletes the current
  zetteldesk-scratch with `erase-buffer' and replaces it with the
  one selected from `zetteldesk-scratch-list'.

  This function is useful when the current zetteldesk-scratch has
  already been saved to `zetteldesk-scratch-list' and you want to
  switch to an inactive one as in that case there is no point to
  re-store it to `zetteldesk-scratch-list'.  Another reason to use
  this is if the scratch is currently empty and you want to fill it
  up."
    (interactive)
    (with-current-buffer "*zetteldesk-scratch*"
      (erase-buffer)
      (insert-file-contents (cdr (assoc
				  (completing-read "Select desktop to activate: "
						   zetteldesk-desktop-list)
				  zetteldesk-desktop-list)))))

#+END_SRC

