zetteldesk-remark.el
;;; zetteldesk-remark.el --- Org-Remark integration for zetteldesk.el   -*- lexical-binding: t; -*-

;; Author: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
;; Maintainer: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
;; URL: https://github.com/Vidianos-Giannitsis/zetteldesk-remark.el
;; Package-Requires: ((zetteldesk "1.0") (org-remark "1.0") (emacs "27.2"))
;; Created: 22nd March 2022
;; License: GPL-3.0
;; Version: 0.2

;; This file is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; For a full copy of the GNU General Public License
;; see <https://www.gnu.org/licenses/>.

;;; Commentary:

;; This file defines some functions for zetteldesk.el which help with
;; integrating it with org-remark.  Org-remark requires the buffer from
;; which its called to be associated with a file.  However the
;; zetteldesk-scratch buffer is not associated with a file.  Therefore,
;; some special things need to be done to allow for this integration
;; to work.  However, I consider that this is a good implementation of
;; such behaviour.

;;; Code:

(require 'zetteldesk)
(require 'org-remark)
