zetteldesk.org
* Info Nodes
    The info buffer is a single persistent buffer. Therefore, the typical things done in the zetteldesk don't work here. This section is an attempt to fix this and use info nodes together with zetteldesk. There is a function that gives the nodes name in a format that all other Info functions accept. I use that function and add the nodes selected to a variable. The rest of the functions, choose something from that list with completing-read and that is how this system works. For example, the removing mechanisms works by using remove with its argument being the output of the completing-read. The insertion function is a function that prompts the user to select an info buffer that is part of the zetteldesk and inserts its contents to the zetteldesk-scratch buffer under a similarly to above formatted heading. Furthermore, it inserts a link to the info node so you can see it in its context. 

** Preamble
    This is just the intro text that needs to be in the start of the file

    #+BEGIN_SRC elisp :tangle zetteldesk-info.el
      ;;; zetteldesk-info.el --- A zetteldesk extension for interacting with the info program   -*- lexical-binding: t; -*-

      ;; Author: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
      ;; Maintainer: Vidianos Giannitsis <vidianosgiannitsis@gmail.com>
      ;; URL: https://github.com/Vidianos-Giannitsis/zetteldesk-info.el
      ;; Package-Requires: ((zetteldesk "0.4") (emacs "27.1"))
      ;; Created: 6th April 2022
      ;; License: GPL-3.0
      ;; Version: 0.2

      ;; This file is free software; you can redistribute it and/or modify
      ;; it under the terms of the GNU General Public License as published by
      ;; the Free Software Foundation; either version 3, or (at your option)
      ;; any later version.

      ;; This program is distributed in the hope that it will be useful,
      ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
      ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
      ;; GNU General Public License for more details.

      ;; For a full copy of the GNU General Public License
      ;; see <https://www.gnu.org/licenses/>.

      ;;; Commentary:

      ;; This package provides some optional improvements to zetteldesk.el.
      ;; Specifically it introduces mechanisms for handling nodes from the
      ;; Info program built in to Emacs, which isn't trivial as its a
      ;; persistent buffer and so the typical predicates used are not
      ;; available for use here

      ;;; Code:

      (require 'zetteldesk)

    #+END_SRC

** The rest of the code

    #+BEGIN_SRC elisp :tangle zetteldesk-info.el

      ;; -- Info Nodes --
      (defcustom zetteldesk-info-nodes '()
	"List of info nodes that are part of the zetteldesk.
      Initialised as an empty list"
	:type 'list
	:group 'zetteldesk)

      (defun zetteldesk-info-add-info-node-to-desktop ()
	"Find the current info-node.
      Then add its name to the list of the variable
      `zetteldesk-info-nodes'"
	(interactive)
	(add-to-list 'zetteldesk-info-nodes (Info-copy-current-node-name)))

      (defun zetteldesk-info-remove-info-node-from-desktop ()
	"Remove an info-node from the `zetteldesk-desktop'.
      The node is selected through a `completing-read' menu of
      `zetteldesk-info-nodes'"
	(interactive)
	(setq zetteldesk-info-nodes (remove
				     (completing-read "Info Nodes: " zetteldesk-info-nodes)
				     zetteldesk-info-nodes)))

      (defun zetteldesk-info-goto-node ()
	"Zetteldesk filter function for `Info-goto-node'.

      Prompts the user to select a node from the list
      `zetteldesk-info-nodes' and jumps to that node"
	(interactive)
	(Info-goto-node (completing-read "Nodes: " zetteldesk-info-nodes)))

      (defun zetteldesk-info-insert-contents (&optional arg)
	"Select an info node that is part of the current `zetteldesk-desktop'.
      Uses a `completing-read' prompt for the selection.

      Then, in the *zetteldesk-scratch* buffer, go to the end of the
      buffer, insert a newline and a heading of the form \"Supportive
      Material - \" the node's name \"(Info)\" akin to what is done in
      `zetteldesk-insert-link-to-pdf'.  Then, insert the contents of the
      chosen info node, removing the first 2 lines which have the
      contextual links of the buffer, as they are not functional
      outside of the info buffer.  Also insert a link with the title
      \"See this node in its context\" which opens the node inside the
      info program. Finally, restore the buffer from which this
      function was called. Ideally, this wouldn't require a
      switch-to-buffer statement, but the function `Info-goto-node'
      used for this function switches the visible buffer to the info
      node and I couldn't find an alternative that only makes it
      current for editing operations, but doesn't change the visible
      buffer to it.

      I find the link to the actual info buffer is useful as a lot of
      the time, you might want to insert the buffer so you can store it
      with other useful information inside the zetteldesk-scratch
      buffer, but then, you are interested in looking into the other
      nodes of the manual you were reading.

      Optional argument ARG which is a `\\[universal-argument]' switch to the
      zetteldesk-scratch buffer in a split."
	(interactive "P")
	(let ((info_node (completing-read "Nodes: " zetteldesk-info-nodes))
	      (location (zetteldesk-insert-location))
	      (buffer (current-buffer)))
	  (Info-goto-node info_node)
	  (with-current-buffer location
	    (goto-char (point-max))
	    (newline)
	    (org-insert-heading)
	    (insert "Supportive Material - " info_node " (Info)")
	    (newline)
	    (save-excursion (insert-buffer-substring "*info*")
			    (insert
			     (org-link-make-string
			      (concat "elisp:(Info-goto-node \"" info_node "\")")
			      "See this node in its context")))
	    (kill-whole-line 2))
	  (switch-to-buffer buffer)
	  (zetteldesk-insert-switch-to-scratch arg)))

    #+END_SRC

    #+RESULTS:
    : zetteldesk-insert-info-contents

* COMMENT Adding keybindings to the hydra
For my package zetteldesk.el, I define some keybindings in the file zetteldesk-kb.el. As I do not use these keybindings myself (I prefer the evil-styled ones that suit my config better tbh) that file is never loaded in my config, therefore this should also not be loaded. However, as I often play around with the code here and not in the zetteldesk directory I want to have this here for copy-paste-ability.

#+BEGIN_SRC elisp :tangle zetteldesk-kb.el

  ;; -- Zetteldesk-ref.el --

  (with-eval-after-load 'zetteldesk-ref
    (pretty-hydra-define+ zetteldesk-insert-hydra ()
      ("Org-Roam"
       (("r" zetteldesk-ref-insert-ref-node-contents "Link to citekey and Node Contents in *zetteldesk-scratch with special formatting")))))

  (with-eval-after-load 'zetteldesk-ref
    (pretty-hydra-define zetteldesk-literature-hydra (:color blue :title "Zetteldesk Literature Nodes")
      ("Org-Roam UI"
       (("r" zetteldesk-ref-find-ref-node))

       "Helm-Bibtex UI"
       (("h" zetteldesk-ref-helm-bibtex-with-notes))

       "Ivy-Bibtex UI"
       (("i" zetteldesk-ref-ivy-bibtex-with-notes)))))

  (with-eval-after-load 'zetteldesk-ref
    (pretty-hydra-define+ zetteldesk-add-hydra ()
      ("Org-Roam"
       (("l" zetteldesk-ref-add-node-to-desktop "Add Literature Node")))))

  (with-eval-after-load 'zetteldesk-ref
    (pretty-hydra-define+ zetteldesk-remove-hydra ()
      ("Org-Roam"
       (("l" zetteldesk-ref-remove-node-from-desktop "Remove Literature Node")))))

  (with-eval-after-load 'zetteldesk-ref
    (pretty-hydra-define+ zetteldesk-main-hydra ()
      ("Filter Functions"
       (("l" zetteldesk-literature-hydra/body "Go to Zetteldesk Literature Node")))))

#+END_SRC

#+RESULTS:
: zetteldesk-main-hydra/body

#+BEGIN_SRC elisp :tangle zetteldesk-kb.el

  ;; -- Zetteldesk-info.el --

  (with-eval-after-load 'zetteldesk-info
    (pretty-hydra-define+ zetteldesk-add-hydra ()
      ("Other"
       (("i" zetteldesk-info-add-info-node-to-desktop "Add Info Node")))))

  (with-eval-after-load 'zetteldesk-info
    (pretty-hydra-define+ zetteldesk-remove-hydra ()
      ("Other"
       (("i" zetteldesk-info-remove-info-node-from-desktop "Remove Info Node")))))

  (with-eval-after-load 'zetteldesk-info
    (pretty-hydra-define+ zetteldesk-main-hydra ()
      ("Filter Functions"
       (("I" zetteldesk-info-goto-node "Go to Zetteldesk Info Node")))))

  (with-eval-after-load 'zetteldesk-info
    (pretty-hydra-define+ zetteldesk-insert-hydra ()
      ("Supplementary Material to *zetteldesk-scratch*"
       (("I" zetteldesk-info-insert-contents "Info Node Contents + Link to context")))))
#+END_SRC

* Providing the packages to be loaded in init.el
#+BEGIN_SRC elisp :tangle zetteldesk.el

  (provide 'zetteldesk)
  ;;; zetteldesk.el ends here

#+END_SRC
  
#+BEGIN_SRC elisp :tangle zetteldesk-ref.el

  (provide 'zetteldesk-ref)
  ;;; zetteldesk-ref.el ends here

#+END_SRC

#+BEGIN_SRC elisp :tangle zetteldesk-info.el

    (provide 'zetteldesk-info)
    ;;; zetteldesk-info.el ends here
#+END_SRC

#+BEGIN_SRC elisp :tangle zetteldesk-remark.el

  (provide 'zetteldesk-remark)
  ;;; zetteldesk-remark.el ends here
#+END_SRC

#+BEGIN_SRC elisp :tangle zetteldesk-kb.el

  (provide 'zetteldesk-kb)
  ;;; zetteldesk-kb.el ends here

#+END_SRC

#+BEGIN_SRC elisp :tangle zetteldesk-ref-citar.el

  (provide 'zetteldesk-ref-citar)
  ;;; zetteldesk-ref-citar.el ends here
#+END_SRC
