zetteldesk-kb.el

(provide 'zetteldesk-kb)
;;; zetteldesk-kb.el ends here
