zetteldesk.el

(provide 'zetteldesk)
;;; zetteldesk.el ends here
